tests/performance/calculator-load.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - flow:
      - post:
          url: "/api/calculator/calculate"
          json:
            num1: 100
            num2: 20
            operation: "+"
          expect:
            - statusCode: 200